
import Box from "@mui/material/Box";
import Typography from "@mui/material/Typography";
import Link from "next/link";
import {makeStyles} from "@mui/styles";


   const Descriptions = ()=>{


        return (
            <>
                <Box className="flex flex-col mt-4 mb-4 mr-10 ml-10">
                   <Typography className="text-xl font-bold mt-2 mb-0 text-ce" variant="h2" component="h2" >
                   اجاره ویلا در سراسر ایران با قیمت ارزان 

                    </Typography>

                    <Typography className="text-sm leading-7 text-justify mt-2 mb-0 text-cent" variant="h2" component="p" paragraph={true} >
                  
                    سفر بخشی جدانشدنی از زندگی اجتماعی است. زمانی که سفر می‌کنیم روحمان را به دست طبیعت می‌سپاریم و از فضای ماشینی شهرها فاصله می‌گیریم. اما دغدغه همیشگی مسافران محل اقامت در مقصدی است که انتخاب می‌کنند. اگر اهل کمپ زدن باشید بزرگترین مشکل اقامتی شما انتخاب محل مناسب برای برپایی کمپ است اما اگر به سکونت و استراحت در خانه علاقه دارید با این دغدغه آشنایید. اتاقک سامانه هوشمند اجاره ویلا و سوئیت ویژه مسافران است و تلاش می‌کند که تا حد امکان دغدغه سکونت را برطرف کند تا بتوانید با خیالی آسوده سفر کنید و خاطرات خوب بسازید. هدف از ایجاد اتاقک فرهنگ‌سازی در زمینه سفرهای اقتصادی با ارائه اقامتگاه ارزان و مناسب برای تمام افراد جامعه و گردشگران است. کاربران اتاقک با می‌توانند با هر سلیقه و بودجه‌ای محل اقامت مناسب خود را در شهرهای مختلف ایران اجاره کنند. بیشترین هزینه سفر معمولا مربوط به اجاره اقامتگاه است اما شما در اتاقک می‌توانید رزرو اقامتگاه ارزان، مثل اجاره ویلا اینترنتی هزینه‌های سفر خود را کاهش دهید و با اجاره سوئیت یا رزرو ویلا ، با قیمتی مناسب، سفری دلچسب و اقتصادی داشته باشید. همچنین اگر به طبیعت علاقه‌مند هستید و دوست دارید چند روزی را در اقامتگاه‌ها طبیعت گردی سپری کنید می‌توانید اقامتگاه‌های بوم گردی اتاقک را انتخاب کنید. ما، در اتاقک، در طول سفر همراه شماییم و همکاران ما، در واحد پشتیبانی، ۲۴ساعته آماده پاسخگویی به شما هستند. خرسندیم که در لحظات خوش سفر همراه شماییم.

                    </Typography>
                </Box>
            </>
        )
   }
   export default Descriptions;