import Box from "@mui/material/Box";
import Typography from "@mui/material/Typography";
import ArrowBackIosIcon from '@mui/icons-material/ArrowBackIos';
import {makeStyles } from "@mui/styles"
import Faq from "./faq"
import {useState} from "react"

const Faqs = ()=>{
   const init_items = [
    {
        title :" چطور به کومه گردی اعتماد کنم؟",
        paragraph :" لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
        showParagraph :false,

    },
    {
        title :" چطور به کومه گردی اعتماد کنم؟",
        paragraph :" لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
        showParagraph :false,

    }
    ,   {
        title :" چطور به کومه گردی اعتماد کنم؟",
        paragraph :" لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
        showParagraph :false,

    }
    ,   {
        title :" چطور به کومه گردی اعتماد کنم؟",
        paragraph :" لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
        showParagraph :false,

    }
    ,   {
        title :" چطور به کومه گردی اعتماد کنم؟",
        paragraph :" لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
        showParagraph :false,

    }
   ]

   const useStyles = makeStyles({
       icon : {
           fontSize : "0.75rem",
       }
   })
   const classes = useStyles();


    const [items , setItems] = useState(init_items)

   const handleClick = (index:number)=>{

    let itms = 
    items.map((item,i)=>{       
        if(i==index){
             item.showParagraph = ! item.showParagraph 
             item.title = item.title
             item.paragraph =  item.paragraph
        }else{
         item.showParagraph = false
         item.title = item.title
         item.paragraph =  item.paragraph
        }

        return item;
     
    });
   
     setItems(itms)
   }

    return (
    <>

    <Box className="mt-10 mb-10 mr-10 ml-10">
    <Typography className={`text-xl font-bold   mt-3 `} variant="h2" component="h2" >
                   سوالات متداول 
    </Typography>
    <Box className={`flex mt-5`}>
    <Typography className={`text-xs  `} variant="h2" component="span" >
                  کومه گردی
    </Typography>
        <ArrowBackIosIcon className={`mr-2 ml-2 text-xs `}  />
    <Typography className={`text-xs `} variant="h2" component="span" >
                  سوالات متداول
     </Typography>

    </Box>

    <Typography className={`text-sm  mt-5 `} variant="h2" component="p" paragraph={true}>
    در این صفحه سعی کردیم پاسخگوی سوالاتی که در زمان استفاده از خدمات اتاقک برای شما پیش می‌آید باشیم. اگر سوال شما در بین این سوالات نیست، با ما تماس بگیرید.
     </Typography>

    
    {
        items.map((item,index)=> 
        <Faq key={index} title={item.title} handleClick={()=>handleClick(index)} paragraph={item.paragraph} showParagraph={item.showParagraph} />)
    }


    </Box>
        
    </>
    )
}
export default Faqs; 